In [10]:
# Import Dependencies
import pandas as pd

In [11]:
# Make a reference to the comic_books_expanded.csv file path
csv_path = "Esophageal Delim.csv"

# Import the comic_books_expanded.csv file as a DataFrame
books_df = pd.read_csv(csv_path, encoding="utf-8")
# Check the special characters imported correctly
books_df.tail()

,DATEDX,Age,Education,Sex,Region,Mstatus,Alcohol,Khat,Tobacco,Comorbidity,...,Chemotherapy,Chemo_type,Chemo_cycle,Radiotherapy,Radio_type,Hospital_stay,FU_last,Status_patient,Date_death,Time_to_death
344,2/6/2016,55,3,2,OROMIA,2,2,1,2,0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
345,2/9/2016,45,2,1,SNNPR,2,2,2,2,0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
346,2/10/2016,67,2,2,ADDIS ABABA,2,2,1,2,0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
347,3/21/2016,32,2,1,OROMIA,2,2,2,2,0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
348,8/1/2016,58,2,2,AMHARA,2,1,1,1,0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [12]:
# Remove unecessary columns from the DataFrame and save the new DataFrame
# Only keep: "ISBN", "Title", "Other titles", "Name", "All names", 
# "Country of publication", "Place of publication", "Publisher", "Date of publication"
reduced_df = books_df[["DATEDX", "Age", "Education", "Sex", "Region", "Mstatus", "Alcohol", 
                       "Khat", "Tobacco", "Weight_loss", "Duration_all",
                       "Endoscopy", "CT_Scan", "Endoscopy", "Hist_grade", "Dist_metas"]]
reduced_df.head()

,DATEDX,Age,Education,Sex,Region,Mstatus,Alcohol,Khat,Tobacco,Weight_loss,Duration_all,Endoscopy,CT_Scan,Endoscopy,Hist_grade,Dist_metas
0,12/14/2010,66,3,1,OROMIA,2,2,2,2,2,3,1,1,1,1,4
1,5/15/2010,66,3,2,ADDIS ABABA,2,2,1,2,1,8,1,2,1,5,4
2,2/2/2010,62,1,2,ADDIS ABABA,2,1,1,1,2,1,1,1,1,5,1
3,3/30/2010,62,1,2,OROMIA,2,1,2,2,1,9,1,2,1,5,2
4,4/15/2010,45,4,1,OROMIA,2,2,2,2,2,5,1,1,1,5,3

In [4]:
# Rename the headers to be more explanatory
renamed_df = reduced_df.rename(columns={"Other titles": "Other Titles",
                                        "Name": "Author",
                                        "All names": "All Names",
                                        "Country of publication": "Country of Publication",
                                        "Place of publication": "Place of Publication",
                                        "Date of publication": "Publication Year", })
renamed_df.head()

,ISBN,Title,Other Titles,Author,All Names,Country of Publication,Place of Publication,Publisher,Publication Year
0,9780930193904,#$@&! : the official Lloyd Llewellyn collection,Official Lloyd Llewellyn collection,"Clowes, Daniel","Clowes, Daniel [person]",England ; United States of America,"London ; Seattle, Washington",Fantagraphics ; Turnaround,1997
1,9780992664220,#WhatDoYouSee? : a graphic novel anthology of ...,NaN,NaN,Fulfilling Lives (Programme) [organisation],England,Newcastle upon Tyne,Roots & Wings,2018
2,9781302903299,#takebacktheshield,NaN,"Spencer, Nick","Spencer, Nick, author [person]",United States of America,New York,Marvel Worldwide,2017
3,9781607065166,'68. Volume 1. Better run through the jungle,Better run through the jungle,"Kidwell, Mark","Fotos, Jay [person] ; Jones, Nat, 1976- [perso...",United States of America,"Berkeley, California",Image Comics,2012
4,9781600107672,'Bots of science,Trans formers ; Trans formers animated : bots ...,"Bryant, Megan E.","Robbins, Robbie [person] ; Boo, 1981- [person]...",United States of America,"San Diego, California",NaN,2010

In [5]:
# Push the remade DataFrame to a new CSV file
renamed_df.to_csv("Output/books_clean.csv",
                  encoding="utf-8", index=False, header=True)